/*
 *****************
 * Parser Tokens *
 *****************
 */

/* Token used to mark comments. Anything on the same line behind this token will be ignored by the parser. */
"COMMENT_TOKEN" = "#";

/* Token used to indicate the end of the declaration, everything behind this will be ignored. */
"END_INDICATOR" = "END";

/* Token used to indiciate the start of the context declaration. */
"CONTEXT_INDICATOR" = "Contexts:";

/* Token used to indicate the start of the link section. */
"LINK_INDICATOR" = "Links:";

/* Token used to seperate context name and capacity */
"CONTEXT_SEPERATOR" = ",";

/* Tokens used to indicate relations */
"WEAK_INCLUSION_TOKEN" = "->";
"STRONG_INCLUSION_TOKEN" = "=>";
"EXCLUSION_TOKEN" = "><";
"REQUIREMENT_TOKEN" = "=<";

/*
 *****************
 * Parser Errors *
 *****************
 */

/* Title of the error window */
"ERROR_WINDOW_TITLE" = "A parsing error occured:";

/* Error shown when there is no state
 arguments: 1 NSString
 */
"NO_STATE_ERROR" = "File must begin with 'Contexts:' instead of '%@'";

/* Error shown when a context name has space
 arguments: 1 NSString
 */
"CONTEXT_NAME_HAS_SPACES" = "A context name cannot contain spaces! %@";

/* Error shown when a context capacity
 is not a number
 arguments: 1 NSString
 */
"CAPACITY_NO_NUMBER" = "Syntax error in context capacity! '%@' should be a number";

/* Error shown when a context capacity
 has too many context_seperators
 arguments: 1 NSString
 */
"CONTEXT_SEPERATOR_AMOUNT" = "Too many ',' in context declaration! '%@'";

/* Error shown when a relation
 has too many spaces
 arguments: 1 NSString
 */
"LINK_DECLARATION_SPACE_AMOUNT" = "Syntax error, too many spaces in: '%@'";

/* Error shown when a context
 mentioned in a relation
 could not be found
 arguments: 1 NSString
 */
"LINK_CONTEXT_NOT_FOUND" = "Unrecognized context in links section, could not find: '%@'";

/* Error shown when a token
 mentioned in a relation
 could not be found
 arguments: 2 NSString
 */
"LINK_TOKEN_NOT_FOUND" = "Syntax error in line: '%@', operator, '%@' not recognised";

/*
 ***********
 * GENERAL *
 ***********
 */

"OK_BUTTON" = "Ok";
"CANCEL_BUTTON" = "Cancel";